In [14]:
import pandas as pd

#### Loading dataset

In [15]:
df = pd.read_csv('customer_data.csv')
df.head()

   customer_id  age gender            email  purchases
0         1001   35      M  abc@example.com       10.0
1         1002   28      F  def@example.com        5.0
2         1003   40      F  ghi@example.com        NaN
3         1004   45      M  jkl@example.com        8.0
4         1005   33      M  mno@example.com       15.0

### Checking for null values

In [16]:
df.isnull().sum()

customer_id    0
age            0
gender         0
email          0
purchases      2
dtype: int64

### Here, `purchases` column is having 2 null values.

### Removing duplicate values.

In [17]:
df.drop_duplicates(subset='customer_id', keep='first', inplace=True)

In [18]:
df.head()

   customer_id  age gender            email  purchases
0         1001   35      M  abc@example.com       10.0
1         1002   28      F  def@example.com        5.0
2         1003   40      F  ghi@example.com        NaN
3         1004   45      M  jkl@example.com        8.0
4         1005   33      M  mno@example.com       15.0

### Replacing the missing values in `purchases` by the mean of the column `purchases`.

In [19]:
df['purchases'].fillna(df['purchases'].mean(), inplace=True)
df.head()

   customer_id  age gender            email  purchases
0         1001   35      M  abc@example.com  10.000000
1         1002   28      F  def@example.com   5.000000
2         1003   40      F  ghi@example.com   9.428571
3         1004   45      M  jkl@example.com   8.000000
4         1005   33      M  mno@example.com  15.000000

### For average number of purchases for each gender

In [21]:
average_purchases_by_gender = df.groupby('gender')['purchases'].mean().reset_index()
print(average_purchases_by_gender)

  gender  purchases
0      F   7.971429
1      M  11.250000